app/controllers/items_controller.rb

INSERT INTO "items" ("number", "name", "desc", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["number", 222.0], ["name", "sdfsfs"], ["desc", "sdsdas"], ["rating", 123.0], ["created_at", "2017-06-30 11:35:12.753807"], ["updated_at", "2017-06-30 11:35:12.753807"]]
---
	def create
		@item = Item.create(params[:item].permit(:name, :desc, :number, :rating))

SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		unless @item = Item.where(id: params[:id]).first